//
// Лабораторная работа №1 по дисциплине "Логические основы интеллектуальных систем"
// Вариант 12: Проверить, является ли формула СКНФ
// Выполнили студенты группы 221703 БГУИР:
// - Оскирко Дмитрий Анатольевич
// - Воложинец Архип Александрович
//
// Перечисление параметров для тестов
// 21.04.2024
//
// Источники:
// - Логические основы интеллектуальных систем. Практикум
//
package org.oskirko.Models;

import java.util.List;

public class TestConstants {
    public static final List<String> TESTS = List.of(
            "((((A\\/B)\\/C)/\\((A\\/(!B))\\/C))/\\(((!A)\\/B)\\/(!C)))",
            "(((!A)/\\B)/\\(!C))",
            "(((((A\\/B)\\/C)/\\((A\\/(!B))\\/C))/\\(((!A)\\/B)\\/(!C)))/\\((A\\/B)\\/(!C)))",
            "A",
            "(A/\\B)",
            "((A/\\B)/\\C)",
            "(!A)",
            "(A\\/B)",
            "((A/\\B)/\\C)",
            "(((A/\\B)/\\C)/\\D)",
            "((!A)\\/B)",
            "(((A\\/B)/\\C)/\\(!D))",
            "((!A)/\\((!B)/\\C))",
            "((A\\/B)/\\((!A)/\\C))",
            "(((((A\\/B)\\/C)/\\((A\\/B)\\/C))/\\((A\\/B)\\/C))/\\((A\\/B)\\/C))"
    );
    public static final double MAX_GRADE = 10;
}
